---
kind: type
id: T:Autodesk.Revit.DB.Events.DocumentCreatedEventArgs
source: html/bd300a6c-382a-60f0-a8b4-eae4a8368bf9.htm
---
# Autodesk.Revit.DB.Events.DocumentCreatedEventArgs

The event arguments used by the DocumentCreated event.

## Syntax (C#)
```csharp
public class DocumentCreatedEventArgs : RevitAPIPostDocEventArgs
```

## Remarks
The newly created document is supplied in these arguments.